In [2]:
import pandas as pd
df = pd.read_csv('heights.csv')
df.head()

    name  height
0  mohan     5.9
1  maria     5.2
2  sakib     5.1
3    tao     5.5
4  virat     4.9

In [4]:
Q1 = df.height.quantile(0.25)
Q3 = df.height.quantile(0.75)
Q1, Q3

(5.25, 6.175)

In [6]:
IQR = Q3 - Q1
IQR

0.9249999999999998

In [8]:
lower_limit = Q1 - 1.5*IQR
upper_limit = Q3 + 1.5*IQR
lower_limit, upper_limit

(3.8625000000000003, 7.5625)

In [14]:
df[(df.height<lower_limit) | (df.height>upper_limit)]

      name  height
9    imran    14.5
12  yoseph     1.2